# GetTemplateParameterIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..GetTemplateParameterIds Method
View Class See Also
---
Returns a list of parameter ids that may be controlled when this view is assigned as a template.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<ElementId> GetTemplateParameterIds()
```

Visual Basic
---
```text
Public Function GetTemplateParameterIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetTemplateParameterIds()
```

# ### Return Value
The parameter ids that may be controlled.
# See Also
View Class
Autodesk.Revit.DB Namespace